testCase2_simpleFoam_KVLCC2/system/blSpecsDict
nLayers 5;
firstCellHeight 0.002739676285048489;
growthRatio 1.3;